
// 1. Сделайте вывод на консоль фразы. "Просто строка и точка"
var strVariable = 'Просто строка';

// 2. Сделайте вывод на консоль фразы. "Это таки строка и точка"
var strVariable2 = 'строка';

// 3. Найдите x1 и x2 для квадратного уравнения x^2 + 10x - 24 = 0;  запись вида x^2 - означает x в степени 2
// выведите промежуточные значения на консоль(например значение дискриминанта); // подсказка...снала высчитайте значение переменной дискриминанта
var D = null;


// 4. Напишите ваше объяснение.. почему этот код работает именно таким образом

var boo = 9;
var zoo = 9;
console.log(boo++ * 2); // 18
console.log(++zoo * 2); // 20
console.log('Равны ли значения переменной zoo и boo друг другу? : ' + (boo === zoo));
console.log('boo = ', boo);
console.log('zoo = ', zoo);

// 5.
// Проинициализируйте x произвольным строковым значением
// Далее объявите переменную z, которой присвойте значение сложения с помощью оператора "+" двух переменных x и y
// Выведите на консоль новообъявленную переменную z
// После этого присвойте переменной z новое значение, которое должно быть строкой...которая получена с помощью конкатенации типов переменных x и y
// После этого выведите новое значение переменной z на консоль , у вас должна получится в консоли фраза
// "Тип переменной x = string , тип переменной y = number"
var x,
    y = 2.5;


// дано две переменной a и b, распишите данные формулы и выведите их на консоль 

var a = 2;
var b = 3;

// например формула a^2 - b^2 
console.log((a-b) * (a + b));

// (a + b) ^ 2
// (a - b) ^ 3