/**
 *  #1 - Внимательно читайте условие, тут задание с тестом на смекалку
 *  Объявите три переменных 
 * Присвойте им значения a = '2' , b = true, c = 2; // переменные трех разных типов
 *  - создайте переменную exp1 = +a + b; и переменную exp2 = b + c;
 * 
 * ( Для тех кто читает условие. {значение переменной} - это значение конкретной переменной в итоговой строке)
 * ( например если a = 7 a b = 9 то будет фраза +7 + 9 = 16)
 * ( И пускай вас не смущает символ плюса возле первого операнда, это задача с тем )
 * ( чтобы подумать о том, почему оно так работает // даю подсказку, думайте о типах)
 * ( Обращайте внимание на результаты )
 * 
 * - Выведите на консоль строку "+{значение переменной а} + {значение переменной b} = {значение переменной exp1}"
 * - Выведите на консоль строку "{значение переменной b} + {значение переменной c} = {значение переменной exp1}"
 * - Проверьте на строгое равенство переменные exp1 и exp2 и выведите результат сравнения на консоль
 * - выведите на консоль каких типов exp1 и exp2 
 * - Проверьте больше ли exp1 нежели exp2
 * - Проверьте меньше ли exp1 нежели exp2
 * - Так же выведите на консоль следующий код:
 * - console.log(exp1 >= exp2); 
 * - console.log(exp2 <= exp2); 
 * - Присвойте новые числовые значения переменным a , b, c ... изменятся ли при этом значения exp1 и exp2?
 * - Присвойте exp1 значение выражения (a * a - b) / c 
 * - Присвойте exp2 значение выражения (a/c) * (b-a)
 * - Выведите результаты на экран
 */